Show / Hide Table of Contents
Class IOMSettings
IOM Settings
Inheritance
System.Object
IOMSettings
Implements
IIOMSettings
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Message
Assembly: IdeaRS.OpenModel.dll
Syntax
public class IOMSettings : IIOMSettings
Constructors
Improve this Doc   View Source
IOMSettings()
Constructor
Declaration
public IOMSettings()
Properties
Improve this Doc   View Source
CountryCode
CountryCode
Declaration
public CountryCode CountryCode { get; set; }
Property Value
 Type |  Description
 CountryCode
Improve this Doc   View Source
CreatedSuccessfully
Create OK
Declaration
public bool CreatedSuccessfully { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
FileName
File name
Declaration
public string FileName { get; set; }
Property Value
 Type |  Description
 System.String
Implements
 IIOMSettings
 Improve this Doc
 View Source